shalaev.org
;; -*- eval: (run-init-block); -*-
#+TITLE: useful lisp macros and functions
#+AUTHOR: Oleg Shalaev
#+EMAIL:  oleg@chalaev.com
#+LaTeX_HEADER: \usepackage[russian,english]{babel}
#+LATEX_HEADER: \usepackage[letterpaper,hmargin={1.5cm,1.5cm},vmargin={1.3cm,2cm},nohead,nofoot]{geometry}
#+KEYWORDS: emacs, elisp, common lisp, macros, functions

* Introduction
The following block is evaluated when this ~.org~ file is loaded:
#+NAME: init
#+BEGIN_SRC emacs-lisp :results output none
(defun cons-to-list(co)
"transforms cons to list"
(if (consp co)
  (cons (car co) (cons-to-list (cdr co)))
  (list co)))
#+END_SRC

Notes:
1. Evaluation results are important part of this file, but =github= org-parser does not show them.
   (BTW [[https://notabug.org/shalaev/lisp-goodies/src/master/goodies.org][notabug does show them]] although unformatted.)  Consider opening this file in ~emacs~ instead of watching it online.
2. Sometimes a demonstration of a function might use the definition of another function defined below in this file or another
   file from the ~generated/~ directory, so you might need to =load= those first. And here comes the first example :)
   using =randstr= function defined in [[file:generated/functions.el][generated/functions.el]]:

#+NAME: randstr
#+BEGIN_SRC emacs-lisp
(concat (rand-str 4) ".tmp")
#+END_SRC

* when-let
=when-let= is one of my most-used macros:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro when-let (vars &rest body)
  "when with let using standard let-notation"
  (if (caar vars)
  `(let ((,(caar vars) ,(cadar vars)))
     ,(if (cdr vars)
	  `(when ,(caar vars)
	     ,(macroexpand-1 `(when-let ,(cdr vars) ,@body)))
	(append `(when ,(caar vars)) body)))
  (if (cdr vars)
      `(when ,(cadar vars)
	     ,(macroexpand-1 `(when-let ,(cdr vars) ,@body)))
    (append `(when ,(cadar vars)) body))))
#+END_SRC

Using standard let-syntax, it evaluates varibales in the header one after another,
and, if they are all non-nil, evalueates the body:
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 
  '(when-let ((x 1) (y (1+ x)))
       (incf x y) (incf y x))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((x 1)) (when x (let ((y (1+ x))) (when y (incf x y) (incf y x)))))
:END:

=when-let= defined here has almost the same functionality, as [[https://common-lisp.net/project/alexandria/draft/alexandria.html][alexandria:when-let*]].
If we put =nil= instead of the variable name, no local varibale will be created for this entry:
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
 `(when-let ((CN (clouded (aref newDBrec cipher))) (nil (not (file-exists-p CN))))
    (+ 1 2)
    (- 1 2))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((CN (clouded (aref newDBrec cipher)))) (when CN (when (not (file-exists-p CN)) (+ 1 2) (- 1 2))))
:END:
– this double =when= is ugly and inefficient, but for ~elisp~ it is probably o.k. because we do not need as much efficiency here, as in Common Lisp.

Later I wrote [[needs]] which is more general than =when-let=, and can replace it.

CL code is the same:
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro when-let (vars &rest body)
  "when with let using standard let-notation"
  (if (caar vars)
  `(let ((,(caar vars) ,(cadar vars)))
     ,(if (cdr vars)
	  `(when ,(caar vars)
	     ,(macroexpand-1 `(when-let ,(cdr vars) ,@body)))
	(append `(when ,(caar vars)) body)))
  (if (cdr vars)
      `(when ,(cadar vars)
	     ,(macroexpand-1 `(when-let ,(cdr vars) ,@body)))
    (append `(when ,(cadar vars)) body))))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest when-let.1
    (when-let ((x (id :ok)))
      (setf x (cons x x))
      x)
  (:ok . :ok))
#+END_SRC

* if-let
Like =when-let=, macro =if-let= is heavily used in my projects.
It is somewhat similar to =when-let=, but offers "else" clause:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro if-let (vars ifyes &rest body)
  "if with let using standard let-notation"
  (let ((if-true (gensym "it")) (result (gensym "r")))
    `(let (,if-true ,result)
       (when-let ,vars
		 (setf ,if-true t
		  ,result ,ifyes))
       (if ,if-true
	   ,result
	 ,@body))))
#+END_SRC
It has almost the same functionality, as [[https://common-lisp.net/project/alexandria/draft/alexandria.html][alexandria:if-let]]
except that instead of single =else-form= there can be multiple forms.

Usage example:
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 
  '(if-let ((x 1) (y (1+ x)))
     (+ x y) (- x y) (* x y))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let (it40 r41) (when-let ((x 1) (y (1+ x))) (setf it40 t r41 (+ x y))) (if it40 r41 (- x y) (* x y)))
:END:

#+BEGIN_SRC emacs-lisp
(let (it40 r41) 
(when-let ((x 1) (y (1+ x))) 
  (setf it40 t
         r41 (+ x y)))
(if it40 r41
   (- x y) (* x y)))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro if-let (vars ifyes &rest body)
  "if with let using standard let-notation"
  (let ((if-true (gensym "it")) (result (gensym "r")))
    `(let (,if-true ,result)
       (when-let ,vars
		 (setf ,if-true t
		       ,result ,ifyes))
       (iff ,if-true ,result ,@body))))
#+END_SRC

Usage example:
#+BEGIN_SRC lisp :results drawer
(macroexpand-1 
  '(if-let ((x 1) (y (1+ x)))
     (+ x y) (- x y) (* x y)))
#+END_SRC

#+RESULTS:
:RESULTS:
(LET (#:|it597| #:|r598|)
  (WHEN-LET ((X 1) (Y (1+ X)))
    (SETF #:|it597| T
          #:|r598| (+ X Y)))
  (IFF #:|it597| #:|r598| (- X Y) (* X Y)))
:END:

Sometimes I need slightly changed versions of =if-let=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro ifn-let (vars ifno &rest body)
  `(if-let ,vars
      (progn ,@body)
      ,ifno))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(ifn-let ((x (+ 1 2))) (+ 3 4) (+ 6 5) (+ 7 9))))
#+END_SRC

#+RESULTS:
:RESULTS:
(if-let ((x (+ 1 2)))
 (progn (+ 6 5) (+ 7 9))
 (+ 3 4))
:END:

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro ifn-let (vars ifno &rest body)
  `(if-let ,vars
      (progn ,@body)
      ,ifno))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest if-let.1
    (if-let ((x (id :ok)))
            x
            :bad)
  :ok)
#+END_SRC

* needs
New =needs= macro is gradually replacing =when-let=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro needs (vardefs &rest body)
  "unifying when-let and if-let"
  (let ((vardef (car vardefs)))
    (if (and (listp vardef) (not (or (special-form-p (car vardef)) (functionp (car vardef)) (macrop (car vardef)))))
    `(let ((,(car vardef) ,(cadr vardef)))
       ,(if (cddr vardef)
	    `(if ,(car vardef)
		,(if (cdr vardefs)
		     (macroexpand-1 `(needs ,(cdr vardefs) ,@body))
		   `(progn ,@body))
	       ,(car (cddr vardef)))
	  (append `(when ,(car vardef))
		  (if (cdr vardefs)
		      (list (macroexpand-1 `(needs ,(cdr vardefs) ,@body)))
		    body))))
    (append `(when ,vardef)
		  (if (cdr vardefs)
		      (list (macroexpand-1 `(needs ,(cdr vardefs) ,@body)))
		    body)))))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro needs(vardefs &rest body)
  "unifying when-let and if-let"
  (let ((vardef (car vardefs)))
    (if (and (listp vardef) (not (functionp (car vardef))))
    `(let ((,(car vardef) ,(cadr vardef)))
       ,(if (cddr vardef)
	    `(if ,(car vardef)
		,(if (cdr vardefs)
		     (macroexpand-1 `(needs ,(cdr vardefs) ,@body))
		   `(progn ,@body))
	       ,(car (cddr vardef)))
	  (append `(when ,(car vardef))
		  (if (cdr vardefs)
		      (list (macroexpand-1 `(needs ,(cdr vardefs) ,@body)))
		    body))))
    (append `(when ,vardef)
		  (if (cdr vardefs)
		      (list (macroexpand-1 `(needs ,(cdr vardefs) ,@body)))
		    body)))))
#+END_SRC

=needs= acts similarly to =when-let= except that for every variable decalared in its header
it has an optional third argument – a form to be evaluated in case the variable turns out to be ~nil~.

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(needs
((x (f 1) (message "could not define x"))
 (y (g x) (message "could not define y")))
(message "let's rock")
(- x y))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((x (f 1))) (if x (let ((y (g x))) (if y (progn (message let's rock) (- x y)) (message could not define y))) (message could not define x)))
:END:

← let me format the output:
#+BEGIN_SRC emacs-lisp
(let ((x (f 1)))
  (if x
    (let ((y (g x)))
      (if y
        (progn
	  (message "let's rock")
	  (- x y))
	(message "could not define y")))
    (message could "not define x")))
#+END_SRC


For other usage examples, see [[https://github.com/chalaev/cloud][cloud]] project, e.g.:
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(needs ((col-value (begins-with str (car column)) (bad-column "action" (cdr column))))
(aset action (cdr column) (car col-value))
(setf str (cdr col-value)))))
#+END_SRC

Sometimes I need a slightly changed version of =needs= that does not create a local variable,
setting the value of a global one instead:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro first2(ll) `(firstN ,ll 2))
(defmacro needs-set (vardefs &rest body)
  "needs with 'let' being replaced with 'setf'"
  (let ((vardef (car vardefs)))
    (if (cddr vardef)
      `(if-set (,(first2 vardef))
	  ,(if (cdr vardefs)
	       (macroexpand-1 `(needs-set ,(cdr vardefs) ,@body))
	     `(progn ,@body))
	  ,(caddr vardef))
      `(when-set (,(car vardefs))
	   ,(if (cdr vardefs)
	       (macroexpand-1 `(needs-set ,(cdr vardefs) ,@body))
	      `(progn ,@body))))))
#+END_SRC

Example #1:
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(needs-set
((x (f 1) (message "did not set x"))
 (y (g x) (message "did not set y")))
(message "let's rock")
(- x y))))
#+END_SRC

#+RESULTS:
:RESULTS:
(if-set ((x (f 1)))
 (if-set ((y (g x)))
 (progn (message let's rock) (- x y))
 (message did not set y))
 (message did not set x))
:END:

and here is the formatted result:
#+BEGIN_SRC emacs-lisp
(if-set ((x (f 1)))
  (if-set ((y (g x)))
     (progn
       (message let's rock)
       (- x y))
     (message "did not set y"))
  (message "did not set x"))
#+END_SRC

Example #2 (from the [[https://github.com/chalaev/cloud][cloud project]]):
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(needs-set
  ((conf (read-conf* (local/config)))
   (remote/files (cdr (assoc "remote/files" conf)) (clog :error "specify 3-symbol contents name (remote/files) in %s" (local/config)))
   (N-CPU-cores (string-to-number
 (or
 (cdr (assoc "number-of-CPU-cores" conf))
 (clog :warning "specify number-of-CPU-cores in %s" (local/config)
 "1"))))
   (password (cdr (assoc "password" conf)) (clog :error "specify password in %s" (local/config)))
   (remote-dir (cdr (assoc "remote-directory" conf)) (clog :error "specify remote-directory in %s" (local/config))))
conf)))
#+END_SRC

#+RESULTS:
:RESULTS:
(when-set ((conf (read-conf* (local/config)))) (if-set ((remote/files (cdr (assoc remote/files conf)))) (when-set ((N-CPU-cores (string-to-number (or (cdr (assoc number-of-CPU-cores conf)) (clog :warning specify number-of-CPU-cores in %s (local/config) 1))))) (if-set ((password (cdr (assoc password conf)))) (if-set ((remote-dir (cdr (assoc remote-directory conf)))) (progn conf) (clog :error specify remote-directory in %s (local/config))) (clog :error specify password in %s (local/config)))) (clog :error specify 3-symbol contents name (remote/files) in %s (local/config))))
:END:
and here is the formatted result:
#+BEGIN_SRC emacs-lisp
(when-set ((conf (read-conf* (local/config))))
  (if-set ((remote/files (cdr (assoc remote/files conf))))
    (when-set ((N-CPU-cores (string-to-number (or (cdr (assoc number-of-CPU-cores conf)) (clog :warning specify number-of-CPU-cores in %s (local/config) 1)))))
      (if-set ((password (cdr (assoc password conf))))
        (if-set ((remote-dir (cdr (assoc remote-directory conf))))
	  (progn conf)
	  (clog :error specify remote-directory in %s (local/config)))
	(clog :error specify password in %s (local/config))))
    (clog :error specify 3-symbol contents name (remote/files) in %s (local/config))))
#+END_SRC

* safe-mkdir
=safe-mkdir= attempts to create a directory; in case of errors it raises no conditions (exceptions).

Its argument ~dirname~ 
- may start with "~/" and
- may or may not end with "/".

#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun safe-mkdir (dirname)
"creates a directory returning the report"
(condition-case err
  (progn (make-directory dirname)  (list t))
 (file-already-exists (cons nil :exists))
 (file-error (cons nil :permission))))
#+END_SRC

=safe-mkdir= returns =cons=; its =car= is
- ~nil~ in case the directory can not be created (then =cdr= explains why), or
- ~t~ in case the directory was sucessfully created,
as one can see from the table generated by the following output:
#+BEGIN_SRC emacs-lisp :var RS=randstr
(let* ((test-dirs (list
         (cons "o.k." RS)
         (cons "not allowed to" (concat "/etc/" RS))
         (cons "already exists" "/"))); BTW, how should one represent root directory in MS-DOS/Windows?
       (result (mapcar #'(lambda(d) (cons (car d) (cons-to-list (safe-mkdir (cdr d))))) test-dirs)))
(safe-delete-dir RS); removing temporary directory
result)
#+END_SRC

#+RESULTS:
| o.k.           | t   | nil         |
| not allowed to | nil | :permission |
| already exists | nil | :exists     |

In SBCL I must know if the directory =dirname= existed before I attempted to create it,
so I have to use (low-level) [[https://github.com/sbcl/sbcl/blob/master/contrib/sb-posix/posix-tests.lisp][sb-posix:mkdir]] function:
#+BEGIN_SRC lisp :tangle generated/files.lisp
(defun safe-mkdir (dirname)
(handler-case (cons t (sb-posix:mkdir dirname #o770))
  (sb-posix:syscall-error (c)
    (cons nil
      (case (sb-posix:syscall-errno c)
        (13 :permission)
        (17 :exists)
        (2 :parent)
        (otherwise (cons :unknown (sb-posix:syscall-errno c))))))))
#+END_SRC
– works on SBCL only.

#+BEGIN_SRC lisp :var RS=randstr
(defun cons-to-list(co)
"transforms cons to list"
(if (consp co)
  (cons (car co) (cons-to-list (cdr co)))
  (list co)))
(let* ((dir (merge-pathnames RS (user-homedir-pathname))); temporary directory name
(test-dirs (list
  (cons "o.k." dir)
  (cons "not allowed to" (concat "/etc/" RS))
  (cons "already exists" "/"))); BTW, how should one represent root directory in MS-Windows?
       (result (mapcar #'(lambda(d) (cons (car d) (safe-mkdir (cdr d)))) test-dirs)))
(uiop:delete-empty-directory dir); removing temporary directory
(mapcar #'cons-to-list result))
#+END_SRC

#+RESULTS:
| o.k.           | T   | 0           |
| not allowed to | NIL | :PERMISSION |
| already exists | NIL | :EXISTS     |

