shalaev.org
* directory-lock
=(directory-lock locked-dir by body...)= attempts to create directory =locked-dir=.
(Linux kernel is made in such a way, that if several processes are simultaneously trying to create nonexistent directory, *only one* of them succeeds.)

If the directory was sucessfully created,
1. file "by" is created inside it containing the string ~by~, and
2. forms ~body~ are evaluated.

Similarly to [[safe-mkdir]], =directory-lock= returns =cons=; its =car= is ~t~ in case all =directory-lock= operations went through successfully:
the directory was successfully locked and later unlocked.

In this case, =(cdr (directory-lock ...))= contains the result of ~body~ evaluation.

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro directory-lock(locked-dir by &rest body)
(let ((LD (gensym "LD")) (lock-file (gensym "LF")) (mkdir (gensym "MD")) (result (gensym "r")) (unlock (gensym "u")))
`(let* ((,LD (file-name-as-directory ,locked-dir))
        (,lock-file (concat ,LD "by"))
        (,mkdir (safe-mkdir ,LD)))
  (ifn (car ,mkdir) (cons nil (cons :lock ,mkdir))
  (write-region ,by nil ,lock-file)
  (let ((,result (progn ,@body)))
    (if-let ((,unlock (and (rm ,lock-file) (safe-delete-dir ,LD))))
      (cons t ,result)
      (cons nil (cons :unlock (cons ,unlock ,result)))))))))
#+END_SRC

*No matter how many processes are trying to lock the same directory simultaneously, at most one will succeed.*

If something went wrong, =(car (directory-lock ...))= is =nil=,
and the problem is described by =(cadr (directory-lock ...))= which is
- ~:lock~ in case the directory could not be locked, or
- ~:unlock~ in case the directory could not be unlocked. That is, we were able to create the directory ~locked-dir~,
  then evaluated the ~body~ forms, but finally could not erase ~locked-dir~.

Example – locking remote directory: 
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(directory-lock "/mnt/server/code-name" (system-name)
(body-1) (body-2))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let* ((ld43 (file-name-as-directory /mnt/server/code-name)) (lf44 (concat ld43 by)) (md45 (safe-mkdir ld43))) (ifn (car md45) (cons nil (cons :lock md45)) (write-region (system-name) nil lf44) (let ((r46 (progn (body-1) (body-2)))) (if-let ((u47 (and (rm lf44) (safe-delete-dir ld43)))) (cons t r46) (cons nil (cons :unlock (cons u47 r46)))))))
:END:

Formatted result:
#+BEGIN_SRC emacs-lisp
(let* ((ld43 (file-name-as-directory "/mnt/server/code-name"))
       (lf44 (concat ld43 "by"))
       (md45 (safe-mkdir ld43)))
  (ifn (car md45) (cons nil (cons :lock md45))
       (write-region (system-name) nil lf44)
       (let ((r46 (progn (body-1) (body-2))))
	 (if-let ((u47 (and (rm lf44) (safe-delete-dir ld43))))
	     (cons t r46)
	   (cons nil (cons :unlock (cons u47 r46)))))))
#+END_SRC

Common Lisp code is more advanced than the elisp one:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.lisp
(defmacro directory-lock(locked-dir by &rest body)
(let ((LD (gensym "ld")) (lock-file (gensym "LF")) (mkdir (gensym "md")) 
      (result (gensym "r")))
`(let* ((,LD (uiop:ensure-directory-pathname  ,locked-dir))
        (,mkdir (safe-mkdir ,LD)))
  (ifn (car ,mkdir) (cons nil (cons :lock (cdr ,mkdir)))
(let ((,lock-file (merge-pathnames #p"by" ,LD)))
  (echo-to-file ,lock-file ,by)
  (let ((,result (progn ,@body)))
#+END_SRC
← requires =echo-to-file= from ~generated/files.lisp~

In case we could not unlock the directory, let us not go into the details:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.lisp
(ifn (car (rm ,lock-file)) (cons nil (cons :file ,result))
(ifn (car (rmdir ,LD)) (cons nil (cons :dir ,result))
(cons t ,result)))))))))
#+END_SRC

Example: 
#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(directory-lock "/mnt/server/code-name" (system-name)
  (body-1) (body-2)))
#+END_SRC

Formatted result:
#+BEGIN_SRC lisp
(LET* ((#:|ld490| (UIOP/PATHNAME:ENSURE-DIRECTORY-PATHNAME "/mnt/server/code-name"))
       (#:|md492| (SAFE-MKDIR #:|ld490|)))
  (IFN (CAR #:|md492|) (CONS NIL (CONS :LOCK (CDR #:|md492|)))
   (LET ((#:LF491 (MERGE-PATHNAMES #P"by" #:|ld490|)))
     (ECHO-TO-FILE #:LF491 (SYSTEM-NAME))
     (LET ((#:|r493| (PROGN (BODY-1) (BODY-2))))
       (IFN (CAR (RM #:LF491)) (CONS NIL (CONS :FILE #:|r493|))
        (IFN (CAR (RMDIR #:|ld490|)) (CONS NIL (CONS :DIR #:|r493|))
         (CONS T #:|r493|)))))))
#+END_SRC

* remo & drop
Remo is a helper for =drop= macro which removes elements from an array:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun remo (from-where &rest what)
  (if (cdr what)
      (remo
       (apply #'remo (cons from-where (cdr what)))
       (car what))
 (remove (car what) from-where)))
(defmacro drop (from-where &rest what)
  `(setf ,from-where (remo ,from-where ,@what)))
#+END_SRC
Test:
#+BEGIN_SRC emacs-lisp :results drawer
(let ((ll '(1 2 3 4 5 6)))
  (drop ll 2 4)
  ll)
#+END_SRC

#+RESULTS:
:RESULTS:
(1 3 5 6)
:END:

For now CL code will be simpler:
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(declaim (notinline id))
(defun id(x) x)
(defmacro drop-if (what from-where &key (key #'id) (test #'eql))
  `(setf ,from-where (remove ,what ,from-where :key ,key :test ,test)))
#+END_SRC

#+BEGIN_SRC lisp
(macroexpand-1 '(drop-if name hooks :key #'car :test #'string=))
#+END_SRC
results in
#+BEGIN_SRC lisp
(SETF HOOKS (REMOVE NAME HOOKS :KEY #'CAR :TEST #'STRING=))
#+END_SRC

* emacs lisp
** emacs configuration in ~/.emacs
You probably want to adjust this code to your needs before pasting it into your =~/.emacs=:
#+BEGIN_SRC emacs-lisp :tangle generated/dot.emacs :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
;; Generated from https://notabug.org/shalaev/lisp-goodies/src/master/shalaev.org
;; See explanations therein. Edit this code before using it.

(defun barename (FN)
  (let ((SS (split-string (file-name-nondirectory FN)  "\\." t)))
    (mapconcat #'(lambda(x)x) (butlast SS) ".")))
#+END_SRC
=printangle= returns the list of exported (tangled) files
#+BEGIN_SRC emacs-lisp :tangle generated/dot.emacs
(defun printangle(FN)
  "to be used in Makefile instead of org-babel-tangle-file"
  (let ((l (length default-directory)))
     (apply #'concat (mapcar #'(lambda(x) (substring (format "%s " x) l)) (org-babel-tangle-file FN)))))
#+END_SRC
← I am using it in my [[https://github.com/chalaev/cl-simple-logger/blob/master/Makefile][Makefile]]s.

Obsoleted by =file-name-nondirectory=:
#+BEGIN_SRC 
(defun basename (FN) (car(last(split-string FN "/" t))))
#+END_SRC

The following function is designed to prevent multiple evaluation of one and the same file:
#+BEGIN_SRC emacs-lisp :tangle generated/dot.emacs
(defvar *loaded* nil "prevents duplicate evaluation of files")
(defun load-file* (x &optional el-prefix)
  (let ((FN (file-chase-links 
             (if (= ?/ (aref x 0)) x
               (concat (or el-prefix 
 (concat (getenv "HOME") "/"))
x)))))
    (unless (member (car (last (split-string FN "\\." t))) '("el" "elc"))
      (setf FN (concat FN ".el")))
    (unless (member FN *loaded*) (load-file FN) (push (barename FN) *loaded*))))
#+END_SRC
Every time I start emacs, I load several files:
#+BEGIN_SRC emacs-lisp :tangle generated/dot.emacs
(mapcar #'(lambda(x) (load-file* x "~/programming/emacs/"))
	'("macros" "functions" "logging"  ....))
#+END_SRC

My ~backup~ system does not save files having the group ~tmp~.
I use this group to mark all generated (tangled) files:
#+BEGIN_SRC emacs-lisp :tangle generated/dot.emacs
(defun after-tangle()
  "mark tangled files as non-backupable (chgrp tmp files) and non-excecutable"
  (let ((FN (buffer-file-name)))
#+END_SRC
The following line is equivalent to =chmod a-x FN=:
#+BEGIN_SRC emacs-lisp :tangle generated/dot.emacs
    (set-file-modes FN (logand #o666 (perms-from-str (nth 8 (file-attributes FN 'string)))))
    (chgrp "tmp" FN)))
(add-hook 'org-babel-post-tangle-hook #'after-tangle)
#+END_SRC
so they are not backuped.

(found online) =run-init-block=  runs ~init~ code block when loading an org-file:
#+BEGIN_SRC emacs-lisp :tangle generated/dot.emacs
(defun run-init-block ()
  (org-babel-goto-named-src-block "init")
  (org-babel-execute-src-block))
#+END_SRC

** replacing cl.el
Just following Stallman's advice, I try to avoid using =cl.el=;
=generated/cl.el= will be my (incomplete for now) replacement for  =cl.el=
to be loaded as follows:
#+BEGIN_SRC emacs-lisp
(unless (functionp 'gensym)
  (load (concat (file-name-as-directory "generated") "cl.el")))
#+END_SRC

*Problem:* I am not sure if eliminating =cl.el= really makes sence because
apparently it is widely used; for example, =M-x org-babel-tangle= uses =cl.el= (although does not require it).

*** gensym
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
;; generated from https://notabug.org/shalaev/lisp-goodies/src/master/shalaev.org
(let ((counter 0))
  (defun gensym(&optional starts-with)
    "for those who miss gensym from Common Lisp"
    (unless starts-with (setf starts-with "gs"))
    (let (sym)
      (while (progn
               (setf sym (make-symbol (concat starts-with (number-to-string counter))))
               (or (special-form-p sym) (functionp sym) (macrop sym) (boundp sym)))
        (incf counter))
      (incf counter)
      sym)))
#+END_SRC
=gensym= is used in macros, e.g.
#+BEGIN_SRC emacs-lisp :results drawer
(let ((ms (gensym "a")))
  `(let ((,ms 0))
     (1+ ,ms)))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((a3 0)) (1+ a3))
:END:

*** find
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defun find(item seq &optional key test)
  (when seq
  (let ((test (or test #'=)))
    (when-let ((CS (car seq)))
      (if-let ((found (funcall test
			       item
			       (if key (funcall key CS) CS))))
	  CS
	(find item (cdr seq) key test))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(find 3 '( 1 2 3 4 5))
#+END_SRC

#+RESULTS:
:RESULTS:
3
:END:

#+BEGIN_SRC emacs-lisp :results drawer
(find 4 '((1 2) (3 4) (5 6)) #'cadr)
#+END_SRC

#+RESULTS:
:RESULTS:
(3 4)
:END:

*** decf and incf
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(unless (or (boundp 'decf) (functionp 'decf) (macrop 'decf))
(defmacro decf (var &optional amount)
  (unless amount (setf amount 1))
  `(setf ,var (- ,var ,amount))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(unless (or (boundp 'incf) (functionp 'incf) (macrop 'incf))
(defmacro incf (var &optional amount)
  (unless amount (setf amount 1))
  `(setf ,var (+ ,var ,amount))))
#+END_SRC

*** flet
It uses =macrolet= which is also defined in  =cl.el= :)

#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defmacro flet(fun-defs &rest body)
(let ((GSs (mapcar #'(lambda(FD) (cons (car FD) (gensym))) fun-defs)))
`(let ,(mapcar #'(lambda(FD)
(list (cdr (assoc (car FD) GSs))
`(lambda ,(cadr FD) ,@(cddr FD)))) fun-defs)
(macrolet ,(mapcar #'(lambda(FD)
(list (car FD) (cadr FD) `(funcall ,(cdr (assoc (car FD) GSs)) ,@(cadr FD)))) fun-defs)
 ,@body))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(flet ((f1(x) (1+ x)) (f2(x) (1- x)))
(+ 1 2 (f1 3))
(* 1 2 (f2 3)))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((G38 (lambda (x) (1+ x)))
      (G39 (lambda (x) (1- x))))
(macrolet ((f1 (x) (funcall G38 x)) 
           (f2 (x) (funcall G39 x)))
 (+ 1 2 (f1 3))
 (* 1 2 (f2 3))))
:END:

To be improved: variable names in =macrolet= should be generated by =gensym=.

** short pieces of code
*** case*
~case*~ is not identical to =case= from =cl.el=:
it uses arbitrary test function:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
;; generated from https://notabug.org/shalaev/lisp-goodies/src/master/shalaev.org
(defmacro case* (expr test &rest cases)
  "case with arbitrary test function"
  (let ((v (gensym "v")))
    `(let ((,v ,expr))
       (cond
        ,@(mapcar #'(lambda (VR)
(let ((val (car VR)) (rest (cdr VR)))
  (if (eql val 'otherwise)
      `(t ,@rest)
    `((,test ,v ,val) ,@rest))))
 cases)))))
#+END_SRC
A simple example:
#+BEGIN_SRC emacs-lisp :results drawer
(macroexpand-1 
 `(case* (+ 1 2) =
    (choice-1 (message "choice-1"))
    (choice-2 (message "choice-2"))
    (otherwise (message "no match"))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((v13 (+ 1 2)))
 (cond 
((= v13 choice-1) (message choice-1))
((= v13 choice-2) (message choice-2))
(t (message no match))))
:END:

Another example is also self-explanatory:
#+BEGIN_SRC emacs-lisp :results drawer
(let ((x 32) (choice-1 22)  (choice-2 33))
  (case* (1+ x) =
    (choice-1 (message "choice-1"))
    (choice-2 (message "choice-2"))
    (otherwise (message "no match"))))
#+END_SRC

#+RESULTS:
:RESULTS:
choice-2
:END:

*** case-let
=case-let= is probably *useless*:
as of 2020-11-04 I think that small convenience due to slight code size reduction does not compensate new symbol introduction, so =case-let= remains unused for now.

Sometimes we may want to access the let-variable name generated in =case*=;
so we define =case-let= which is only a slightly modified version of =case*=:
#+BEGIN_SRC emacs-lisp
(defmacro case-let (let-var expr test &rest cases)
  "case* with let expriable named by the user"
    `(let ((,let-var ,expr))
       (cond
        ,@(mapcar #'(lambda (VR)
(let ((val (car VR)) (rest (cdr VR)))
  (if (eql val 'otherwise)
      `(t ,@rest)
    `((,test ,let-var ,val) ,@rest))))
 cases))))
#+END_SRC
A simple example:
#+BEGIN_SRC emacs-lisp :results drawer
(macroexpand-1 
 `(case-let x (+ 1 2) =
    (choice-1 (format "1: x=%d" x))
    (choice-1 (format "2: x=%d" x))
    (otherwise (message "no match"))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((x (+ 1 2))) (cond ((= x choice-1) (format 1: x=%d x)) ((= x choice-1) (format 2: x=%d x)) (t (message no match))))
:END:

*** when-set and unless-set
Sometimes instead of =when-let= I use somewhat similar =when-set= macro.
=when-set= is similar to =when-let= except for that it uses existing global variables instead of creating local ones.

#+begin_note
Global variable values will *not* be set to ~nil~.
#+end_note

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro when-set (vars &rest body)
  "when-let using global variable instead of defining local one"
(let ((GV (gensym)))
  `(let ((,GV ,(cadar vars)))
     ,(if (cdr vars)
	  `(when ,GV
              (setf ,(caar vars) ,GV)
	     ,(macroexpand-1 `(when-set ,(cdr vars) ,@body)))
	(append `(when ,GV (setf ,(caar vars) ,GV)) body)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
 `(when-set ((CN (clouded (aref newDBrec cipher))) (NFE (not (file-exists-p CN))))
    (+ 1 2)
    (- 1 2))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((it15 (clouded (aref newDBrec cipher))))
 (when it15 (setf CN it15) 
   (let ((it16 (not (file-exists-p CN))))
      (when it16 (setf NFE it16) (+ 1 2) (- 1 2)))))
:END:

=unless-set= is similar to =when-set=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro unless-set (vars &rest body)
  "unless-let using global variable instead of defining local one"
(let ((GV (gensym)))
  `(let ((,GV ,(cadar vars)))
     ,(if (cdr vars)
	  `(if ,GV
              (setf ,(caar vars) ,GV)
	     ,(macroexpand-1 `(unless-set ,(cdr vars) ,@body)))
	(append `(if ,GV (setf ,(caar vars) ,GV)) body)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
 `(unless-set ((CN (aref newDBrec cipher)) (FE (file-exists-p CN)))
    (+ 1 2)
    (- 1 2))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((g30 (aref newDBrec cipher)))
  (if g30
     (setf CN g30) 
(let ((g31 (file-exists-p CN)))
    (if g31 (setf FE g31)
       (+ 1 2)
       (- 1 2)))))
:END:

