shalaev.org
*** if-set
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro if-set (vars &rest body)
  (let ((if-true (gensym "it")) (result (gensym "r")))
    `(let (,if-true ,result)
       (setf ,result (when-set ,vars
		  (setf ,if-true t)
		  ,(car body)))
       (if ,if-true ,result
	 ,@(cdr body)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
  '(if-set ((x 1) (y (1+ x)))
     (+ x y) (- x y) (* x y))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let (it28 r29) 
(setf r29 (when-set ((x 1) (y (1+ x))) (setf it28 t) (+ x y)))
 (if it28 r29 (- x y) (* x y)))
:END:

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro ifn-set (vars ifno &rest body)
`(if-set ,vars
   (progn ,@body)
   ,ifno))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 (macroexpand-1 
'(ifn-set
  ((remote/files (cdr (assoc "remote/files" conf)))
   (N-CPU-cores (string-to-number (or (cdr (assoc "number-of-CPU-cores" conf)) "1")))
   (password  (cdr (assoc "password" conf)))
   (remote-dir (cdr (assoc "remote-directory" conf))))
(clog :error "something is missing or wrong in the configuration file" remote-dir)
(print "everything is ok")
(print "so we proceed")))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let (it32 r33) 
  (setf r33
	(when-set ((remote/files (cdr (assoc remote/files conf)))
		   (N-CPU-cores (string-to-number (or (cdr (assoc number-of-CPU-cores conf)) 1)))
		   (password (cdr (assoc password conf)))
		   (remote-dir (cdr (assoc remote-directory conf))))
		  (setf it32 t)
		  (progn (print everything is ok) (print so we proceed))))
  (if it32
      r33
    (clog :error something is missing or wrong in the configuration file remote-dir)))
:END:

*** cond-let
=cond-let= is a natural generalization of =if-let=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro cond-let (&rest conds)
  "cond with let"
  (let ((c (car conds)) (r (cdr conds)))
    (if (equal (car c) 'otherwise) `(progn ,@(cdr c))
    (if r
	`(if-let ,(car c) (progn ,@(cdr c)) ,(macroexpand-1 `(cond-let ,@r)))
	`(when-let ,(car c) ,@(cdr c))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
  '(cond-let
    (((x 1) (y (1+ x))) (+ x y) (- x y) (* x y))
    (((x 3) (y (1+ x))) (+ x y) (- x y) (/ x y))
    (otherwise 22 33))))
#+END_SRC

#+RESULTS:
:RESULTS:
(if-let ((x 1) (y (1+ x)))
 (progn (+ x y) (- x y) (* x y)) 
(if-let ((x 3) (y (1+ x)))
 (progn (+ x y) (- x y) (/ x y))
 (progn 22 33)))
:END:

Formatted result:
#+BEGIN_SRC emacs-lisp
(if-let ((x 1) (y (1+ x)))
  (progn (+ x y) (- x y) (* x y))
  (if-let ((x 3) (y (1+ x))) 
    (progn (+ x y) (- x y) (/ x y))
    (progn 22 33)))
#+END_SRC

Common Lisp version is the same as elisp one:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.lisp
(defmacro cond-let(&rest conds)
  "cond with let"
  (let ((c (car conds)) (r (cdr conds)))
    (if (equal (car c) 'otherwise) `(progn ,@(cdr c))
    (if r
	`(if-let ,(car c) (progn ,@(cdr c)) ,(macroexpand-1 `(cond-let ,@r)))
	`(when-let ,(car c) ,@(cdr c))))))
#+END_SRC

*** email
A non-interactive =email= function:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
(defun email (addr &optional subject body)
  "fast non-interactive way to send an email"
  (compose-mail addr (if subject subject ""))
  (when body (insert body))
  (message-send-and-exit))
#+END_SRC
– will work if mailing system (~exim4~ in my case) is configured properly.

*** pos
Position of an element in a list:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun pos (el ll)
  (let ((i 0) r)
  (dolist (e ll r)
    (if (eql e el)
	(setf r i)
      (incf i)))))
#+END_SRC

*** perms-from-str
When I ask ~emacs~ to show me file's permissions, it provides a text string (e.g., "-rw-rw----") instead of a number.
The following function produces a number from such a string:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun perms-from-str (str)
"parses file mode string into integer"
  (let ((text-mode (reverse (cdr (append str nil)))) (mode 0) (fac 1))
    (loop for c in text-mode for i from 0
          unless (= c ?-) do (incf mode fac)
          do (setf fac (* 2 fac)))
    mode))
#+END_SRC
Usage example:
#+BEGIN_SRC emacs-lisp :results drawer
(perms-from-str "-rw-rw----")
#+END_SRC

#+RESULTS:
:RESULTS:
432
:END:

*** perms-to-str
=perms-to-str= is just the opposite of [[perms-from-str]].
#+BEGIN_SRC emacs-lisp :results drawer
(let ((ll '((1 . 0))))
  (dotimes (i 8 ll)
     (push (cons (* 2 (caar ll)) (mod (1+ i) 3))  ll)))
#+END_SRC

#+RESULTS:
:RESULTS:
((256 . 2) (128 . 1) (64 . 0) (32 . 2) (16 . 1) (8 . 0) (4 . 2) (2 . 1) (1 . 0))
:END:

#+BEGIN_SRC emacs-lisp :results drawer
(let ((ll '((1 . 0))))
  (dotimes (i 8 ll)
     (push (cons (* 2 (caar ll)) (mod (1+ i) 3))  ll)))
#+END_SRC

#+RESULTS:
:RESULTS:
((256 . 2) (128 . 1) (64 . 0) (32 . 2) (16 . 1) (8 . 0) (4 . 2) (2 . 1) (1 . 0))
:END:

#+BEGIN_SRC emacs-lisp :results drawer
(let ((ll '((1 . 0))) (file-mode #o664))
  (apply #'concat (mapcar
		   #'(lambda(x) (format "%c" (if (= 0 (logand file-mode (car x))) ?- (aref "xwr" (cdr x)))))
  (dotimes (i 8 ll)
     (push (cons (* 2 (caar ll)) (mod (1+ i) 3))  ll)))))
#+END_SRC

#+RESULTS:
:RESULTS:
rw-rw-r--
:END:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun perms-to-str(file-mode)
"formats integer file mode into string"
(let ((ll '((1 . 0))))
  (apply #'concat (mapcar
		   #'(lambda(x) (format "%c" (if (= 0 (logand file-mode (car x))) ?- (aref "xwr" (cdr x)))))
  (dotimes (i 8 ll)
     (push (cons (* 2 (caar ll)) (mod (1+ i) 3))  ll))))))
#+END_SRC
Usage example:
#+BEGIN_SRC emacs-lisp :results drawer
(perms-to-str #o667)
#+END_SRC

#+RESULTS:
:RESULTS:
rw-rw-rwx
:END:

*** parsing time and date
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-date (str)
  (mapcar 'string-to-number
	  (cond
 ((string-match "\\([0-9]\\{4\\}\\)[/-]\\([0-9][0-9]\\)[/-]\\([0-9][0-9]\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(3 2 1)))
 ((string-match "\\([0-9][0-9]\\)[/-]\\([0-9][0-9]\\)[/-]\\([0-9]\\{4\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(2 1 3)))
 ((string-match "\\([0-9][0-9]\\)\\.\\([0-9][0-9]\\)\\.\\([0-9]\\{4\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(1 2 3)))
 ((string-match "\\([0-9][0-9]\\)/\\([0-9][0-9]\\)/\\([0-9]\\{2\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(2 1 3)))
 ((string-match "\\([0-9]\\{2\\}\\)[/-]\\([0-9][0-9]\\)" str) (append (mapcar #'(lambda (x) (match-string x str)) '(2 1)) (list (format-time-string "%Y" (current-time)))))
 (t (clog :error "date format not recognized in %s" str) nil))))
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-only-time (str)
  (firstN (parse-time-string str) 3))
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-date-time(str)
  (if (string-match "[0-9]\\{4\\}-[0-9][0-9]-[0-9][0-9] [0-9][0-9]:[0-9][0-9]" str)
      (parse-time-string str)
    (let ((SS (split-string str)))
      (append (parse-only-time (cadr SS))
	      (parse-date (car SS))))))
#+END_SRC
Example:
#+BEGIN_SRC emacs-lisp :results drawer
(cons (parse-only-time "16:09:37")
(mapcar #'(lambda(x) (format-time-string "%F %H:%M:%S %Z" (apply #'encode-time (parse-date-time x))))
 (list "10/21 14:54"
        "2020-10-10 14:54:40  EDT")))
#+END_SRC

#+RESULTS:
:RESULTS:
((37 9 16) 2020-10-21 14:54:00 EDT 2020-10-10 14:54:40 EDT)
:END:

*** simple stuff
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro ifn (test ifnot &rest ifyes)
`(if (not ,test) ,ifnot ,@ifyes))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun firstN(lista N)
  "returning first N elments of the list"
  (when (and (< 0 N) (car lista))
    (cons (car lista) (firstN (cdr lista) (1- N)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defvar *good-chars*
(let ((forbidden-symbols '(?! ?@ ?# ?$ ?% ?& ?* ?\( ?\) ?+ ?= ?/ ?{ ?} ?\[ ?\] ?: ?\; ?< ?> ?_ ?- ?| ?, ?. ?` ?' ?~ ?^ ?\")))
    (append
     (loop for i from ?A to ?Z unless (member i forbidden-symbols) collect i)
     (loop for i from ?a to ?z unless (member i forbidden-symbols) collect i)
     (loop for i from ?0 to ?9 unless (member i forbidden-symbols) collect i)))
"safe characters for file names")
(defun rand-str(N)
  (apply #'concat
     (loop repeat N collect (string (nth (random (length *good-chars*)) *good-chars*)))))
#+END_SRC

There is probably some standard function or macro doing this:
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro end-push (what where)
  `(if ,where (push ,what (cdr (last ,where)))
      (push ,what ,where)))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest end-push.1
(let (container)
  (end-push 1 container)
  container)
(1))
(deftest end-push.2
(let (container)
  (end-push 1 container)
  (end-push 2 container)
  container)
(1 2))
#+END_SRC

** file/directory fuctions
*** chgrp
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
;; generated from https://notabug.org/shalaev/lisp-goodies/src/master/shalaev.org
(defun chgrp(group file-name)
  (= 0 (call-process "chgrp" nil nil nil group file-name)))
#+END_SRC
See also =dired-do-chown=.
*** rm (for files)
=rm= is a condition-free wrapper on top of =delete-file=.
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun rm(FN)
"erases files only, not directories"
  (condition-case err (cons t (delete-file FN))
    (file-error (cons nil (error-message-string err)))))
#+END_SRC
Removal of nonexistent file does not lead to an error.

Example #1 – removing file with insufficient permissions produces "permission denied" error:
#+BEGIN_SRC emacs-lisp :results drawer
(rm  "/bin/ls")
#+END_SRC

#+RESULTS:
:RESULTS:
(nil . Removing old name: Permission denied, /bin/ls)
:END:

Example #2 – removing nonexistent file produces no error:
#+BEGIN_SRC emacs-lisp :results drawer
(rm  "/bin/there-is-no-such-file")
#+END_SRC

#+RESULTS:
:RESULTS:
(t)
:END:

Example #3 – an attempt to remove a directory produces an error:
#+BEGIN_SRC emacs-lisp :results drawer
(rm  "/tmp")
#+END_SRC

#+RESULTS:
:RESULTS:
(nil . Removing old name: is a directory: /tmp)
:END:

To (non-recursively) remove a directory, one can use =safe-delete-dir= instead:

*** safe-delete-dir
Non-recursive directory removal.

Its return result is similar to that of =rm= and =safe-mkdir=:
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun safe-delete-dir (FN &optional recursive)
  (condition-case err (progn (delete-directory FN recursive) (list t))
    (file-error (cons nil (error-message-string err)))))
#+END_SRC

** logging system
It is probably too small to be packaged.
*** Short description
This code prints log messages to ~*Messages*~ buffer and saves them to log file =~/.emacs.d/elisp.log=.
Every message is formatted similarly to how it is done by =format= function.
*** Code
Global variable =*log-level*= controls how much information should be logged: the (default) zero value means
that all types of log-messages (:debug :warning :info :error) should be logged (saved);
the value 3 means that only error messages (marked with :error) will be logged:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
;; generated from https://notabug.org/shalaev/lisp-goodies/src/master/shalaev.org
(unless (boundp '*log-level*) (defvar *log-level* 0))
(unless (boundp '*emacs-d*) (defvar *emacs-d* (concat (getenv "HOME") "/.emacs.d/")))
#+END_SRC
Log messages are accumulated in =*file-acc-buffer*=
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(unless (boundp '*file-acc-buffer*) (defvar *file-acc-buffer* nil))
(defvar *last-FLD* nil "saves last day printed to the log file")
#+END_SRC
and once in a while (when the number of queued messages >30 or before quitting ~emacs~) appended to the file =~/.emacs.d/elisp.log=:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun clog-flush()
  "save log messages to file for debugging"
  (when (= 0 *log-level*)
    (with-temp-buffer
      (let ((today-str (format-time-string "%04Y-%02m-%02d" (current-time))))
	(unless (string= today-str *last-FLD*)
	  (setf *last-FLD* today-str)
	  (insert today-str) (newline))
	(dolist (msg (reverse *file-acc-buffer*))
	  (insert msg) (newline)))
      (append-to-file (point-min) (point-max) (concat *emacs-d* "elisp.log")))
    (setf *file-acc-buffer* nil)))
#+END_SRC
Since we have [[https://www.emacswiki.org/emacs/EmacsLispLimitations][no multi-threading in elisp]], we do not need to introduce any lock functions.
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun file-acc-push(msg)
  (push msg *file-acc-buffer*)
  (when (< 30 (length *file-acc-buffer*)) (clog-flush)))
#+END_SRC
The main logging function:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun clog (level fstr &rest args)
  "simple logging function" ; level is one of → :debug :info :warning :error
  (when (<= *log-level* (or (pos level '(:debug :info :warning :error)) 0))
    (let ((log-msg
	   (cons
	    (concat "%s " (format-time-string "%H:%M:%S "
(apply 'encode-time (butlast (decode-time (current-time)) 3)))
		    fstr)
	    (cons (symbol-name level) args))))
      (file-acc-push (apply #'format log-msg))
      (apply #'message log-msg)) nil))
#+END_SRC
where I inserted =nil= at the end just for convenience, since I often use
=clog= for error messages:
#+BEGIN_SRC emacs-lisp
(if (we-got-problems)
(clog :error "we've got %d problems!" 1000)
(the-rest-of-code))
#+END_SRC
← in case of "problems" I want this code block to return =nil=.

Let us not forget to flush the log
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun on-emacs-exit()
  (clog :debug "flushing comments before quiting emacs")
  (clog-flush))
#+END_SRC
before quitting emacs:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(add-hook 'kill-emacs-hook 'on-emacs-exit)
#+END_SRC
* common lisp
** iff
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro iff (test-form then &rest else)
  "elisp-kind of if"
  (if (cdr else)
      `(if ,test-form ,then (progn ,@else))
      (if (car else)
	  `(if ,test-form ,then ,@else)
	  `(when ,test-form ,then))))
#+END_SRC

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2))
#+END_SRC

#+RESULTS:
:RESULTS:
(WHEN 1 2)
T
:END:

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2 3))
#+END_SRC

#+RESULTS:
:RESULTS:
(IF 1
    2
    3)
T
:END:

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2 3 4))
#+END_SRC

#+RESULTS:
:RESULTS:
(IF 1
    2
    (PROGN 3 4))
T
:END:

